InformationRegisters/ТерриторииОрганизацийПоКоронавирусу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТерриторииОрганизацийПоКоронавирусу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииСПовышающимКоэффициентомПоКоронавирусу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТерриторииОрганизацийПоКоронавирусу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТерриторииОрганизаций(Организации = Неопределено) Экспорт
	
	ТерриторииОрганизаций = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организации",Организации);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Организации = Неопределено);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТерриторииОрганизацийПоКоронавирусу.Организация КАК Организация,
	|	ТерриторииОрганизацийПоКоронавирусу.Территория КАК Территория
	|ИЗ
	|	РегистрСведений.ТерриторииОрганизацийПоКоронавирусу КАК ТерриторииОрганизацийПоКоронавирусу
	|ГДЕ
	|	(&ПоВсемОрганизациям
	|			ИЛИ ТерриторииОрганизацийПоКоронавирусу.Организация В (&Организации))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТерриторииОрганизаций.Вставить(Выборка.Организация, Выборка.Территория);
	КонецЦикла;
	
	Возврат ТерриторииОрганизаций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
